БИТУправление_медицинским_центром_демо/src/InformationRegisters/СостоянияЗаказовНаИзготовление/СостоянияЗаказовНаИзготовление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияЗаказовНаИзготовление</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.ВидыСостоянийЗаказов</types>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DefinedType.КомплексныйРасчетКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DefinedType.ДокументыСменыСтатусовЗаказовНаПроизводство</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ЗначенияПараметровHTML/ЗначенияПараметровHTML.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияПараметровHTML</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.ПараметрыHTML</types>
    </type>
  </resources>
  <dimensions>
    <name>Параметр</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ПараметрыHTML</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DefinedType.ДокументУстановкиЗначенияПараметраПриема</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИндексШаблона</name>
    <comment>Индекс строки шаблона приема в документе</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ВыполнениеЭтаповКомплексногоРасчета/ВыполнениеЭтаповКомплексногоРасчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВыполнениеЭтаповКомплексногоРасчета</name>
  <resources>
    <name>Выполнен</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнительФакт</name>
    <type>
      <types>DefinedType.ИсполнителиЭтаповКомплексногоРасчета</types>
    </type>
  </attributes>
  <dimensions>
    <name>КомплексныйРасчет</name>
    <type>
      <types>DefinedType.КомплексныйРасчетКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЭтапа</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторСтрокой</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРегистратор</name>
    <type>
      <types>DefinedType.ДокументыВыполненияЭтаповКомплексногоРасчета</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Enums/ТипыКомплексныхРасчетовКлиентов/ТипыКомплексныхРасчетовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКомплексныхРасчетовКлиентов</name>
  <enumValues>
    <name>КомплекснаяПрограмма</name>
  </enumValues>
  <enumValues>
    <name>ПредварительныйРасчет</name>
  </enumValues>
  <enumValues>
    <name>ПроизводственныйРасчет</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/ВидыПараметровСпецификаций/ВидыПараметровСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПараметровСпецификаций</name>
  <enumValues>
    <name>ПараметрHTML</name>
  </enumValues>
  <enumValues>
    <name>ЗначениеЗаполнения</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/ТипыАлгоритмов/ТипыАлгоритмов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыАлгоритмов</name>
  <enumValues>
    <name>Алгоритм</name>
  </enumValues>
  <enumValues>
    <name>ЗначениеРеквизита</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Documents/КомплексныйРасчетКлиента/КомплексныйРасчетКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КомплексныйРасчетКлиента</name>
  <registerRecords>AccumulationRegister.НоменклатураКомплексныхРасчетовКлиентов</registerRecords>
  <registerRecords>AccumulationRegister.ВыработкаСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровНаСкладах</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыКомплексныхРасчетовКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Прейскурант</name>
    <type>
      <types>CatalogRef.Прейскуранты</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Остановлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимыйДолг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Прием</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентАванса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИгнорироватьДолг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСоСкидкой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИгнорироватьДолг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сырье</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Спецификация</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>CatalogRef.ПараметрыСпецификаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДобавленАвтоматически</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиСортировки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыРабот</name>
    <attributes>
      <name>ИдентификаторЭтапа</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторСтрокой</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсполнительПлан</name>
      <type>
        <types>DefinedType.ИсполнителиЭтаповКомплексногоРасчета</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Catalogs/ВидыКомплексныхРасчетовКлиентов/ВидыКомплексныхРасчетовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКомплексныхРасчетовКлиентов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКомплексныхРасчетовКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленныйУчетВзаиморасчетов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимыйДолг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентАванса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Прейскурант</name>
    <type>
      <types>CatalogRef.Прейскуранты</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьМенятьПараметрыДолга</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПродажуНеПоЦенеРасчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПрименениеСкидокПриПродаже</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксНумерации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИгнорироватьДолг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИгнорироватьДолг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Спецификация</name>
    <attributes>
      <name>ПараметрСпецификации</name>
      <type>
        <types>CatalogRef.ПараметрыСпецификаций</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоУмолчанию</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыРабот</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Catalogs/ПараметрыСпецификаций/ПараметрыСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПараметрыСпецификаций</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидПараметра</name>
    <type>
      <types>EnumRef.ВидыПараметровСпецификаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ПараметрыHTML</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВПечатнойФорме</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитИсточник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстАлгоритма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыАлгоритмов</types>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/CommonModules/УправлениеЗаказами/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает сумму по столбцу "Сумма" в заказе.
Функция ПолучитьСуммаЗаказа(ДокументСсылка) Экспорт
	
	Если ЗначениеЗаполнено(ДокументСсылка) И ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КомплексныйРасчетКлиента") Тогда
		СуммаЗаказа = ДокументСсылка.Состав.Итог("Сумма");
		Возврат СуммаЗаказа;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	

КонецФункции

Процедура ДвиженияПоЗаказамМатериалов(ДокументОбъект, Отказ, Заказ = Неопределено, УстанавливаемоеСостояние = Неопределено, ВыполнятьПроверкуКорректностиСтатуса = Истина) Экспорт
		
	// Очистка состояний по документу.
	СостоянияЗаказов = РегистрыСведений.СостоянияЗаказовНаИзготовление.СоздатьНаборЗаписей();
	СостоянияЗаказов.Отбор.Документ.Установить(ДокументОбъект.Ссылка);
	СостоянияЗаказов.Записать();
	
	Если УстанавливаемоеСостояние = Неопределено Тогда 
		УстанавливаемоеСостояние = ПолучитьУстанавливаемоеСостояниеПоДокументу(ДокументОбъект.Ссылка);
		Если УстанавливаемоеСостояние = Неопределено Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если Заказ = Неопределено Тогда 
		
		Заказ = КомплексныеРасчетыКлиентов.ПолучитьРеквизитКомплексногоРасчетаВДокументе(ДокументОбъект.Ссылка);
		Если Не ЗначениеЗаполнено(Заказ) Тогда 
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЭтоЗаказНаПроизводство(Заказ) Тогда 
		Возврат;
	КонецЕсли;
	
	Если ВыполнятьПроверкуКорректностиСтатуса И Не ПроверитьДатуСтатусЗаказа(ДокументОбъект, Заказ, УстанавливаемоеСостояние) Тогда
		Отказ = Истина;
		Возврат;	
	КонецЕсли;
	
	СостояниеЗаказа = РегистрыСведений.СостоянияЗаказовНаИзготовление.СоздатьМенеджерЗаписи();
	СостояниеЗаказа.Заказ = Заказ;
	СостояниеЗаказа.Документ = ДокументОбъект.Ссылка;
	СостояниеЗаказа.Ответственный = ДокументОбъект.Ответственный;
	СостояниеЗаказа.Период = ДокументОбъект.Дата;
	СостояниеЗаказа.Состояние = УстанавливаемоеСостояние;
	СостояниеЗаказа.Записать();
	
КонецПроцедуры

Процедура ПроверкаСменыЗаказаДокумента(ДокументОбъект, Отказ) Экспорт
	
	ПредЗаказ = КомплексныеРасчетыКлиентов.ПолучитьРеквизитКомплексногоРасчетаВДокументе(ДокументОбъект.Ссылка);
	Если Не ЗначениеЗаполнено(ПредЗаказ) Тогда 
		Возврат;
	КонецЕсли;
	Заказ = КомплексныеРасчетыКлиентов.ПолучитьРеквизитКомплексногоРасчетаВДокументе(ДокументОбъект);
	
	ЭтоСменаЗаказаНаПроизводство = (ЗначениеЗаполнено(ПредЗаказ) И 
		ЭтоЗаказНаПроизводство(ПредЗаказ) И 
		Заказ <> ПредЗаказ);
		
	Если Не ЭтоСменаЗаказаНаПроизводство Тогда 
		Возврат;
	КонецЕсли;
	
	ОтменаДвиженияПоЗаказамМатериалов(ДокументОбъект, ПредЗаказ, Отказ);
	
КонецПроцедуры

Процедура ОтменаДвиженияПоЗаказамМатериалов(ДокументОбъект, Отказ, Заказ = Неопределено) Экспорт
	
	Если Заказ = Неопределено Тогда 
		
		Заказ = КомплексныеРасчетыКлиентов.ПолучитьРеквизитКомплексногоРасчетаВДокументе(ДокументОбъект.Ссылка);
		Если Не ЗначениеЗаполнено(Заказ) Тогда 
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЭтоЗаказНаПроизводство(Заказ) Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостоянияЗаказовНаИзготовление.Период,
	|	СостоянияЗаказовНаИзготовление.Документ,
	|	СостоянияЗаказовНаИзготовление.Состояние,
	|	СостоянияЗаказовНаИзготовление.Ответственный,
	|	СостоянияЗаказовНаИзготовление.Состояние.Код
	|ИЗ
	|	РегистрСведений.СостоянияЗаказовНаИзготовление КАК СостоянияЗаказовНаИзготовление
	|ГДЕ
	|	СостоянияЗаказовНаИзготовление.Заказ = &Заказ
	|	И (СостоянияЗаказовНаИзготовление.Период > &Период)
	|	И СостоянияЗаказовНаИзготовление.Документ <> &ЭтотДокумент";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("Период", ДокументОбъект.Дата);
	Запрос.УстановитьПараметр("ЭтотДокумент", ДокументОбъект.Ссылка);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проведение данного документа не может быть отменено. Существует документ "
				+ ВыборкаДетальныеЗаписи.Документ + ", который был либо проведен позднее либо передвинул заказ в следующее состояние.");	
		Отказ = Истина;
		Возврат;
	КонецЕсли;
			
	// Очистка состояний по документу.
	СостоянияЗаказов = РегистрыСведений.СостоянияЗаказовНаИзготовление.СоздатьНаборЗаписей();
	СостоянияЗаказов.Отбор.Документ.Установить(ДокументОбъект.Ссылка);
	СостоянияЗаказов.Записать();
	
КонецПроцедуры

Функция ПроверитьДатуСтатусЗаказа(ДокументОбъект, ДокументОснование, УстанавливаемоеСостояние)
	
	Результат = Истина;
	
	ДанныеТекущегоСостояния = ПолучитьСостояниеЗаказа(ДокументОснование, ДокументОбъект.Дата);
	
	Если ЗначениеЗаполнено(ДанныеТекущегоСостояния.Состояние) И 
		ДанныеТекущегоСостояния.Состояние <> УстанавливаемоеСостояние 
	Тогда
		
		ДопустимыеСледующиеСостояния = ПолучитьДопустимыеПереходыСостоянияЗаказа(ДанныеТекущегоСостояния.Состояние);
		
		Если ДопустимыеСледующиеСостояния.Найти(УстанавливаемоеСостояние) = Неопределено Тогда
			
			Результат = Ложь;
			СообщениеОбОшибке = "Заказ не может быть переведен в состояние " + УстанавливаемоеСостояние + " из состояния " + ДанныеТекущегоСостояния.Состояние;
			Если ЗначениеЗаполнено(ДанныеТекущегоСостояния.Документ) Тогда
				СообщениеОбОшибке = СообщениеОбОшибке + " установленного документом " + ДанныеТекущегоСостояния.Документ;
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
			
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоЗаказНаПроизводство(ВидЗаказ) Экспорт
	
	Если ЗначениеЗаполнено(ВидЗаказ) Тогда
		Если ТипЗнч(ВидЗаказ) = Тип("ДокументСсылка.КомплексныйРасчетКлиента") Тогда
			Вид = ВидЗаказ.Вид;
		ИначеЕсли ТипЗнч(ВидЗаказ) = Тип("СправочникСсылка.ВидыКомплексныхРасчетовКлиентов") Тогда
			Вид = ВидЗаказ;
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
		Возврат Вид.Тип = Перечисления.ТипыКомплексныхРасчетовКлиентов.ПроизводственныйРасчет;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Процедура СоздатьЗаписьИзмененияСостоянияЗаказа(Заказ, Состояние, Дата = Неопределено, Документ = Неопределено) Экспорт
	
	Запись = РегистрыСведений.СостоянияЗаказовНаИзготовление.СоздатьМенеджерЗаписи();
	Запись.Заказ		= Заказ;
	Запись.Состояние	= Состояние;
	Запись.Период		= ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата());
	Запись.Документ		= Документ;
	Запись.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Запись.Записать(Истина);
	
КонецПроцедуры

Процедура ЗаполнитьСпецификацииПоЗначениямЗаполнения(ДокументОбъект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыКомплексныхРасчетовКлиентовСпецификация.ПараметрСпецификации КАК ПараметрСпецификации,
	|	ВидыКомплексныхРасчетовКлиентовСпецификация.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию,
	|	ВидыКомплексныхРасчетовКлиентовСпецификация.Ссылка КАК ВидЗаказа,
	|	ВидыКомплексныхРасчетовКлиентовСпецификация.НомерСтроки
	|ПОМЕСТИТЬ СпецификацияПоВидуЗаказа
	|ИЗ
	|	Справочник.ВидыКомплексныхРасчетовКлиентов.Спецификация КАК ВидыКомплексныхРасчетовКлиентовСпецификация
	|ГДЕ
	|	ВидыКомплексныхРасчетовКлиентовСпецификация.Ссылка = &ВидЗаказа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыСпецификацийАлгоритмы.Ссылка КАК Ссылка,
	|	ПараметрыСпецификацийАлгоритмы.РеквизитИсточник КАК РеквизитИсточник,
	|	ПараметрыСпецификацийАлгоритмы.ТекстАлгоритма КАК ТекстАлгоритма,
	|	ПараметрыСпецификацийАлгоритмы.Тип КАК Тип,
	|	СпецификацияПоВидуЗаказа.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию,
	|	СпецификацияПоВидуЗаказа.ВидЗаказа КАК ВидЗаказа,
	|	ПараметрыСпецификацийАлгоритмы.НаименованиеВПечатнойФорме КАК СсылкаНаименованиеВПечатнойФорме, 
	|	СпецификацияПоВидуЗаказа.НомерСтроки
	|ИЗ
	|	СпецификацияПоВидуЗаказа КАК СпецификацияПоВидуЗаказа
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПараметрыСпецификаций КАК ПараметрыСпецификацийАлгоритмы
	|		ПО СпецификацияПоВидуЗаказа.ПараметрСпецификации = ПараметрыСпецификацийАлгоритмы.Ссылка
	|ГДЕ
	|	ПараметрыСпецификацийАлгоритмы.Ссылка.ВидПараметра = &ВидПараметраСпецификации
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
		
	Запрос.УстановитьПараметр("Документ", ДокументОбъект.ДокументОснование);
	Запрос.УстановитьПараметр("ВидЗаказа", ДокументОбъект.Вид);
	Запрос.УстановитьПараметр("ВидПараметраСпецификации", Перечисления.ВидыПараметровСпецификаций.ЗначениеЗаполнения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выб = РезультатЗапроса.Выбрать();
	                      
	Пока Выб.Следующий() Цикл
		Если Выб.Тип = Перечисления.ТипыАлгоритмов.ЗначениеРеквизита Тогда
			Попытка
				РезультатРасчета = ДокументОбъект[Выб.РеквизитИсточник];
			Исключение
				РезультатРасчета = Выб.ЗначениеПоУмолчанию;
			КонецПопытки;	
		ИначеЕсли Выб.Тип = Перечисления.ТипыАлгоритмов.Алгоритм Тогда
			РезультатРасчета		= "";
			СтруктураДанных = Новый Структура("ТекстАлгоритма, Объект, ЗначениеПоУмолчанию ",
			Выб.ТекстАлгоритма, ДокументОбъект, Выб.ЗначениеПоУмолчанию);
			ВыполнитьАлгоритмВЗащищенномКонтексте(СтруктураДанных, РезультатРасчета);
			// При расширении функционала.
		Иначе
			РезультатРасчета = Выб.ЗначениеПоУмолчанию;
		КонецЕсли;
		
		нСпец = ДокументОбъект.Спецификация.Добавить();
		нСпец.Параметр				= Выб.Ссылка;
		нСпец.Значение				= РезультатРасчета;
		нСпец.ДобавленАвтоматически = Истина;
		нСпец.НомерСтрокиСортировки = Выб.НомерСтроки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСпецификацииПоПараметрамHTML(ДокументОбъект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияПараметровHTML.Параметр,
	|	ЗначенияПараметровHTML.Значение
	|ПОМЕСТИТЬ ПараметрыПриема
	|ИЗ
	|	РегистрСведений.ЗначенияПараметровHTML КАК ЗначенияПараметровHTML
	|ГДЕ
	|	ЗначенияПараметровHTML.Документ = &Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыКомплексныхРасчетовКлиентовСпецификация.ПараметрСпецификации КАК ПараметрСпецификации,
	|	ВидыКомплексныхРасчетовКлиентовСпецификация.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию,
	|	ВидыКомплексныхРасчетовКлиентовСпецификация.Ссылка КАК ВидЗаказа,
	|	ВидыКомплексныхРасчетовКлиентовСпецификация.НомерСтроки
	|ПОМЕСТИТЬ СпецификацияПоВидуЗаказа
	|ИЗ
	|	Справочник.ВидыКомплексныхРасчетовКлиентов.Спецификация КАК ВидыКомплексныхРасчетовКлиентовСпецификация
	|ГДЕ
	|	ВидыКомплексныхРасчетовКлиентовСпецификация.Ссылка = &ВидЗаказа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыСпецификацийАлгоритмы.Ссылка,
	|	ПараметрыСпецификацийАлгоритмы.РеквизитИсточник,
	|	ПараметрыСпецификацийАлгоритмы.ТекстАлгоритма,
	|	ПараметрыСпецификацийАлгоритмы.Тип,
	|	ПараметрыСпецификацийАлгоритмы.Источник,
	|	СпецификацияПоВидуЗаказа.ЗначениеПоУмолчанию,
	|	СпецификацияПоВидуЗаказа.ВидЗаказа,
	|	ПараметрыСпецификацийАлгоритмы.НаименованиеВПечатнойФорме,
	|	СпецификацияПоВидуЗаказа.НомерСтроки
	|ПОМЕСТИТЬ ПараметрыСпецификации
	|ИЗ
	|	СпецификацияПоВидуЗаказа КАК СпецификацияПоВидуЗаказа
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПараметрыСпецификаций КАК ПараметрыСпецификацийАлгоритмы
	|		ПО СпецификацияПоВидуЗаказа.ПараметрСпецификации = ПараметрыСпецификацийАлгоритмы.Ссылка
	|ГДЕ
	|	ПараметрыСпецификацийАлгоритмы.Ссылка.ВидПараметра = &ВидПараметраСпецификации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыСпецификации.Ссылка КАК Ссылка,
	|	ПараметрыСпецификации.РеквизитИсточник КАК РеквизитИсточник,
	|	ПараметрыСпецификации.ТекстАлгоритма КАК ТекстАлгоритма,
	|	ПараметрыСпецификации.Тип КАК Тип,
	|	ПараметрыСпецификации.Источник КАК Источник,
	|	ЕСТЬNULL(ПараметрыПриема.Значение, НЕОПРЕДЕЛЕНО) КАК ЗначениеПараметра,
	|	ПараметрыПриема.Значение,
	|	ПараметрыСпецификации.НаименованиеВПечатнойФорме КАК СсылкаНаименованиеВПечатнойФорме,
	|	ПараметрыСпецификации.ВидЗаказа,
	|	ПараметрыСпецификации.ЗначениеПоУмолчанию,
	|	ПараметрыСпецификации.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ПараметрыСпецификации КАК ПараметрыСпецификации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыПриема КАК ПараметрыПриема
	|		ПО ПараметрыСпецификации.Источник = ПараметрыПриема.Параметр
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Документ", ДокументОбъект.ДокументОснование);
	Запрос.УстановитьПараметр("ВидЗаказа", ДокументОбъект.Вид);
	Запрос.УстановитьПараметр("ВидПараметраСпецификации", Перечисления.ВидыПараметровСпецификаций.ПараметрHTML);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выб = РезультатЗапроса.Выбрать();
	
	Пока Выб.Следующий() Цикл
		Если Выб.Тип = Перечисления.ТипыАлгоритмов.ЗначениеРеквизита Тогда
			Если ЗначениеЗаполнено(Выб.ЗначениеПараметра) Тогда
				Результат = Выб.ЗначениеПараметра;
			Иначе
				Результат = Выб.ЗначениеПоУмолчанию;
			КонецЕсли;
		ИначеЕсли Выб.Тип = Перечисления.ТипыАлгоритмов.Алгоритм Тогда
			Результат		= "";
			СтруктураДанных = Новый Структура("ТекстАлгоритма, Источник, ДокументОснование, ЗначениеПараметра, ЗначениеПоУмолчанию ",
			Выб.ТекстАлгоритма, Выб.Источник, ДокументОбъект.ДокументОснование, Выб.ЗначениеПараметра, Выб.ЗначениеПоУмолчанию);
			ВыполнитьАлгоритмВЗащищенномКонтексте(СтруктураДанных, Результат)
			// При расширении функционала.
		Иначе
			РезультатРасчета = Выб.ЗначениеПоУмолчанию;
		КонецЕсли;
		
		нСпец = ДокументОбъект.Спецификация.Добавить();
		нСпец.Параметр				= Выб.Ссылка;
		нСпец.Значение				= Результат;
		нСпец.ДобавленАвтоматически = Истина;
		нСпец.НомерСтрокиСортировки = Выб.НомерСтроки;
	КонецЦикла;
	
КонецПроцедуры

Процедура УпорядочитьПараметрыСпецификации(ДокументОбъект) Экспорт
	ДокументОбъект.Спецификация.Сортировать("НомерСтрокиСортировки Возр");
КонецПроцедуры

Процедура ВыполнитьАлгоритмВЗащищенномКонтексте(СтруктураДанных, Результат)
	Попытка
		Выполнить(СтруктураДанных.ТекстАлгоритма); 
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ИнформацияОбОшибке().Описание);
		Результат = СтруктураДанных.ЗначениеПоУмолчанию;
	КонецПопытки;	
КонецПроцедуры

Функция ПолучитьСостояниеЗаказа(Заказ, Дата) Экспорт
	
	Результат = Новый Структура("Состояние, Период, Документ");
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СостоянияЗаказовНаИзготовление.Период КАК Период,
	|	СостоянияЗаказовНаИзготовление.Состояние,
	|	СостоянияЗаказовНаИзготовление.Документ
	|ИЗ
	|	РегистрСведений.СостоянияЗаказовНаИзготовление КАК СостоянияЗаказовНаИзготовление
	|ГДЕ
	|	СостоянияЗаказовНаИзготовление.Заказ = &Заказ
	|	И СостоянияЗаказовНаИзготовление.Период <= &Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Дата),Дата, ТекущаяДата()));
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДопустимыеПереходыСостоянияЗаказа(Состояние)
	
	Результат = Новый Массив;
	
	СправочникСостояния = Справочники.ВидыСостоянийЗаказов;
	
	Если Состояние = СправочникСостояния.ВозвращенПоГарантии Тогда
		Результат.Добавить(СправочникСостояния.ПереданВМастерскую);
		Результат.Добавить(СправочникСостояния.Принят);
		Результат.Добавить(СправочникСостояния.УКлиента);
	Иначе
		Выб = Справочники.ВидыСостоянийЗаказов.Выбрать();
		Пока Выб.Следующий() Цикл
			Если Состояние.Код < Выб.Код Тогда
				Результат.Добавить(Выб.Ссылка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьУстанавливаемоеСостояниеПоДокументу(ДокументСсылка) Экспорт 
	
	ТипДокумента = ТипЗнч(ДокументСсылка);
	Состояния = Справочники.ВидыСостоянийЗаказов;
	
	Если ТипДокумента = Тип("ДокументСсылка.КомплексныйРасчетКлиента") Тогда 
		Возврат Состояния.Принят;
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОказаниеУслуг") Или ТипДокумента = Тип("ДокументСсылка.РаботыПоРекламации") Тогда 
		Возврат Состояния.УКлиента;
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПередачаЗаказаВМастерскую") Тогда 
		Возврат Состояния.ПереданВМастерскую;
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПриемЗаказаИзМастерской") Тогда 
		Возврат Состояния.ПолученИзМастерской;
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВыполнениеЗаказа") Тогда 
		Возврат Состояния.ПолученИзМастерской;
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.Рекламация") Тогда 
		Возврат Состояния.ВозвращенПоГарантии;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#Область ЭтапыРабот

// Функция - Получить таблицу этапов работ с отметками о выполнении.
//
// Параметры:
//  КомплексныйРасчет	 - ДокументСсылка.КомплексныйРасчет - Ссылка на документ расчета.
//  ЭтапыРабот			 - ДанныеФормыКоллекция - Таблица, содержащая этапы работ, если не указана - таблица работ будет
//                                         выбрана из документа расчета.
// 
// Возвращаемое значение:
// ТаблицаЗначений - Таблица со списком этапов и заполненными отметками о выполнении (дата выполнения, пользователь).
//
Функция ПолучитьТаблицуЭтаповРаботСОтметкамиОВыполнении(КомплексныйРасчет, ЭтапыРабот = Неопределено) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Если ЭтапыРабот <> Неопределено Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтапыРабот.ИдентификаторЭтапа,
		|	ЭтапыРабот.Номенклатура,
		|	ЭтапыРабот.ИсполнительПлан
		|ПОМЕСТИТЬ ЭтапыРабот
		|ИЗ
		|	&ЭтапыРабот КАК ЭтапыРабот";
		Запрос.УстановитьПараметр("ЭтапыРабот", ЭтапыРабот.Выгрузить());
	Иначе	
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КомплексныйРасчетКлиентаЭтапыРабот.ИдентификаторЭтапа,
		|	КомплексныйРасчетКлиентаЭтапыРабот.Номенклатура,
		|	КомплексныйРасчетКлиентаЭтапыРабот.ИсполнительПлан
		|ПОМЕСТИТЬ ЭтапыРабот
		|ИЗ
		|	Документ.КомплексныйРасчетКлиента.ЭтапыРабот КАК КомплексныйРасчетКлиентаЭтапыРабот
		|ГДЕ
		|	КомплексныйРасчетКлиентаЭтапыРабот.Ссылка = &КомплексныйРасчет";
		Запрос.УстановитьПараметр("КомплексныйРасчет", КомплексныйРасчет);
	КонецЕсли;
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыполнениеЭтаповКомплексногоРасчета.КомплексныйРасчет,
	|	ВыполнениеЭтаповКомплексногоРасчета.ИдентификаторЭтапа,
	|	ВыполнениеЭтаповКомплексногоРасчета.Выполнен,
	|	ВыполнениеЭтаповКомплексногоРасчета.ДокументРегистратор,
	|	ВыполнениеЭтаповКомплексногоРасчета.Пользователь,
	|	ВыполнениеЭтаповКомплексногоРасчета.ИсполнительФакт
	|ПОМЕСТИТЬ ВыполненныеЭтапыПоРасчету
	|ИЗ
	|	РегистрСведений.ВыполнениеЭтаповКомплексногоРасчета КАК ВыполнениеЭтаповКомплексногоРасчета
	|ГДЕ
	|	ВыполнениеЭтаповКомплексногоРасчета.КомплексныйРасчет = &КомплексныйРасчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтапыРабот.ИдентификаторЭтапа,
	|	ЭтапыРабот.Номенклатура,
	|	ЭтапыРабот.ИсполнительПлан,
	|	ВыполненныеЭтапыПоРасчету.ИсполнительФакт,
	|	ВыполненныеЭтапыПоРасчету.Пользователь,
	|	ВыполненныеЭтапыПоРасчету.ДокументРегистратор,
	|	ЕСТЬNULL(ВыполненныеЭтапыПоРасчету.Выполнен, ДАТАВРЕМЯ(1, 1, 1)) КАК Выполнен,
	|	ЕСТЬNULL(ВыполненныеЭтапыПоРасчету.Выполнен, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1) КАК ОтметкаВыполнения
	|ИЗ
	|	ЭтапыРабот КАК ЭтапыРабот
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВыполненныеЭтапыПоРасчету КАК ВыполненныеЭтапыПоРасчету
	|		ПО ЭтапыРабот.ИдентификаторЭтапа = ВыполненныеЭтапыПоРасчету.ИдентификаторЭтапа";
	Запрос.УстановитьПараметр("КомплексныйРасчет", КомплексныйРасчет);
		
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ОчиститьОтметкиОВыполненииЭтаповДокумента(ДокументВыполнения) Экспорт 
	
	ВыполненныеЭтапыНЗ = РегистрыСведений.ВыполнениеЭтаповКомплексногоРасчета.СоздатьНаборЗаписей();
	ВыполненныеЭтапыНЗ.Отбор.ДокументРегистратор.Установить(ДокументВыполнения);
	ВыполненныеЭтапыНЗ.Записать();
	
КонецПроцедуры

// Процедура - Отметить выполненные этапы расчета.
//
// Параметры:
//  КомплексныйРасчет	 - 	 - 
//  ВыполненныеЭтапы	 - 	 - 
//  ДокументВыполнения	 - 	 - 
//
Процедура ОтметитьВыполненныеЭтапыРасчета(КомплексныйРасчет, ВыполненныеЭтапы, ДокументВыполнения) Экспорт
	
	ОчиститьОтметкиОВыполненииЭтаповДокумента(ДокументВыполнения);
	
	ВыполненныеЭтапыНЗ = РегистрыСведений.ВыполнениеЭтаповКомплексногоРасчета.СоздатьНаборЗаписей();
	ВыполненныеЭтапыНЗ.Отбор.КомплексныйРасчет.Установить(КомплексныйРасчет);
	ВыполненныеЭтапыНЗ.Отбор.ДокументРегистратор.Установить(ДокументВыполнения);
	ВыполненныеЭтапыНЗ.Прочитать();
		
	Для Каждого СтрокаЭтап Из ВыполненныеЭтапы Цикл
		
		ВыполненныйЭтап = ВыполненныеЭтапыНЗ.Добавить();
		ЗаполнитьЗначенияСвойств(ВыполненныйЭтап, СтрокаЭтап);
		ВыполненныйЭтап.КомплексныйРасчет = КомплексныйРасчет;
		ВыполненныйЭтап.ДокументРегистратор = ДокументВыполнения;
		
	КонецЦикла;
	
	ВыполненныеЭтапыНЗ.Записать();
	
КонецПроцедуры

Процедура УстановитьУсловноеОформлениеЭтапамРабот(Форма, ИмяТаблицыЭтапов = "ЭтапыРабот") Экспорт 
	
	// Запрет изменений этапа, если он уже выполнен в другом документе.
	ЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "ЭтапыРабот";
	
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЭтапыРабот");
	
	ГруппаОтбораИ = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбораИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяТаблицыЭтапов + ".Выполнен");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяТаблицыЭтапов + ".ВыполненВЭтомДокументе");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;	
	ЭлементОтбора.ПравоеЗначение = Ложь;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// Оформление поля текущего документа.
	ЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "ЭтапыРабот";
	
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ЭтапыРаботДокументРегистратор");

	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяТаблицыЭтапов + ".ВыполненВЭтомДокументе");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;	
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "Этот документ");
	
КонецПроцедуры

#КонецОбласти

#Область ПодпискиНаСобытия

Процедура ЗаказыНаПроизводствоПередЗаписьюОбработчик(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Отказ
		Или (Источник.ДополнительныеСвойства.Свойство("НеДелатьПроверокПриЗаписи")
				И Источник.ДополнительныеСвойства.НеДелатьПроверокПриЗаписи = Истина)
	Тогда
		Возврат;
	КонецЕсли;
	
	ПроверкаСменыЗаказаДокумента(Источник, Отказ);
	
КонецПроцедуры

Процедура ЗаказыНаПроизводствоПриЗаписиОбработчик(Источник, Отказ) Экспорт
	
	Если Источник.ПометкаУдаления Тогда
		ОчиститьОтметкиОВыполненииЭтаповДокумента(Источник.Ссылка);
	ИначеЕсли Источник.ДополнительныеСвойства.Свойство("ВыполненныеЭтапыРабот") Тогда
		Заказ = КомплексныеРасчетыКлиентов.ПолучитьРеквизитКомплексногоРасчетаВДокументе(Источник);
		Если Заказ = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ОтметитьВыполненныеЭтапыРасчета(Заказ, Источник.ДополнительныеСвойства.ВыполненныеЭтапыРабот, Источник.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаказыНаПроизводствоОбработкаПроведенияОбработчик(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("НеВыполнятьДвиженияПоЗаказуНаПроизводство") Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПоЗаказамМатериалов(Источник, Отказ);
	
	// Этапы выполнения
	КомплексныеРасчетыКлиентовСервер.ВыполнитьДвиженияПоВыработкеСотрудниковПоВыполненнымЭтапам(Источник, Отказ);
	
КонецПроцедуры

Процедура ЗаказыНаПроизводствоУдалениеПроведенияОбработчик(Источник, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОтменаДвиженияПоЗаказамМатериалов(Источник, Отказ);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
